---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyEnum
source: html/b76e6350-2812-de68-5ab5-623dc770e1a9.htm
---
# AssetPropertyEnum Members

Adds a new connected asset attached to this asset property, if it allows it.